/**
 * @license
 * Copyright 2025 Google LLC
 * SPDX-License-Identifier: Apache-2.0
 */

export const shortAsciiLogo = `
██╗  ███╗   ██╗ ██████╗ ████████╗   ███╗   ███╗██╗   ██╗      ██████╗ ███████╗███╗   ███╗██╗███╗   ██╗██╗
╚██╗ ████╗  ██║██╔═══██╗╚══██╔══╝   ████╗ ████║╚██╗ ██╔╝     ██╔════╝ ██╔════╝████╗ ████║██║████╗  ██║██║
 ╚██╗██╔██╗ ██║██║   ██║   ██║█████╗██╔████╔██║ ╚████╔╝█████╗██║  ███╗█████╗  ██╔████╔██║██║██╔██╗ ██║██║
 ██╔╝██║╚██╗██║██║   ██║   ██║╚════╝██║╚██╔╝██║  ╚██╔╝ ╚════╝██║   ██║██╔══╝  ██║╚██╔╝██║██║██║╚██╗██║██║
██╔╝ ██║ ╚████║╚██████╔╝   ██║      ██║ ╚═╝ ██║   ██║        ╚██████╔╝███████╗██║ ╚═╝ ██║██║██║ ╚████║██║
╚═╝  ╚═╝  ╚═══╝ ╚═════╝    ╚═╝      ╚═╝     ╚═╝   ╚═╝         ╚═════╝ ╚══════╝╚═╝     ╚═╝╚═╝╚═╝  ╚═══╝╚═╝
`;

export const longAsciiLogo = shortAsciiLogo;
export const tinyAsciiLogo = shortAsciiLogo;

export const shortAsciiLogoCompactText = `
▟▛▀▀█▖▜█▀▀▜▝██▙▗██▛▝█▛▝██▙ ▜█▘▜█▘
▐█     ▐█▄▌  █▌▜█▘█▌ █▌ █▌▜▙▐█ ▐█ 
▝█▖ ▜█▘▐█ ▘▗ █▌   █▌ █▌ █▌ ▜██ ▐█ 
 ▝▀▀▀▀ ▀▀▀▀▀▝▀▀  ▝▀▀▝▀▀▝▀▀  ▀▀▘▀▀▘
`;

export const longAsciiLogoCompactText = shortAsciiLogoCompactText;

export const tinyAsciiLogoCompactText = `
▟▛▀▀█▖
▐█     
▝█▖ ▜█▘
 ▝▀▀▀▀ 
`;
